#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.ВидХраненияАккаунта) Тогда
		Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль;
	КонецЕсли;

	ПарольВХранилище = ОбщегоНазначенияСтраж.ПолучитьПароль(Объект.Ссылка);
	Пароль = ?(ЗначениеЗаполнено(ПарольВХранилище), УникальныйИдентификатор, "");
	
	ОбновитьВидимостьИДоступность();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначенияСтраж.ОбработатьПарольФормыПриЗаписи(ТекущийОбъект.Ссылка, ПарольИзменен, Пароль);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидХраненияАккаунтаПриИзменении(Элемент)
	ОбновитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьИДоступность()
	Элементы.Аккаунт.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт);
	Элементы.Логин.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль);
	Элементы.Пароль.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль);
КонецПроцедуры

#КонецОбласти
