



#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоИБ
&НаКлиенте
Процедура ДеревоИБВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ДеревоИБОбъект Тогда
		ПоказатьЗначение(, Элементы.ДеревоИБ.ТекущиеДанные.Объект);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Зачитать(Команда)
	ЗачитатьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗачитатьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦентральныеСерверы.Ссылка КАК Ссылка,
		|	ЦентральныеСерверы.Наименование КАК Наименование,
		|	ЦентральныеСерверы.АдресRAS КАК АдресRAS,
		|	ЦентральныеСерверы.ПортRAS КАК ПортRAS,
		|	ЦентральныеСерверы.ВидХраненияАккаунта КАК ВидХраненияАккаунта,
		|	ЦентральныеСерверы.Логин КАК Логин,
		|	ЦентральныеСерверы.Аккаунт КАК Аккаунт
		|ИЗ
		|	Справочник.ЦентральныеСерверы КАК ЦентральныеСерверы
		|ГДЕ
		|	НЕ ЦентральныеСерверы.ПометкаУдаления
		|	И НЕ ЦентральныеСерверы.ЭтоГруппа";
	Выборка = Запрос.Выполнить().Выбрать();
	Дерево = РеквизитФормыВЗначение("ДеревоИБ");
	Дерево.Строки.Очистить();

	Пока Выборка.Следующий() Цикл
		ПараметрыАдминистрированияКластера = ПараметрыАдминистрированияКластераRAS(Выборка);
		
		СтрокаСервера = Дерево.Строки.Добавить();
		СтрокаСервера.Имя = Строка(Выборка.Наименование);
		СтрокаСервера.Объект = Выборка.Ссылка;
		Кластеры = АдминистрированиеКластера.СвойстваКластеров(ПараметрыАдминистрированияКластера);
		Для Каждого Кластер Из Кластеры Цикл
			СтрокаКластера = СтрокаСервера.Строки.Добавить();
			СтрокаКластера.Имя = Кластер.Получить("name");
			СтрокаКластера.Объект = Справочники.Кластеры.ПолучитьИлиСоздатьКластер(Выборка.Ссылка, СтрокаКластера.Имя);
			ПараметрыАдминистрированияКластера.ИмяАдминистратораКластера = "";
			ПараметрыАдминистрированияКластера.ПарольАдминистратораКластера = "";

			
			ИнформационныеБазы = АдминистрированиеКластера.СвойстваИнформационныхБаз(
																	Кластер.Получить("cluster"),
																	ПараметрыАдминистрированияКластера);
			Для Каждого ИнформационнаяБаза Из ИнформационныеБазы Цикл
				СтрокаИБ = СтрокаКластера.Строки.Добавить();
				СтрокаИБ.Имя = ИнформационнаяБаза.Получить("name");

				СтрокаИБ.Объект = Справочники.ИнформационныеБазы.ПолучитьИлиСоздатьИБ(
																		СтрокаКластера.Объект, 
																		СтрокаИБ.Имя	);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дерево, "ДеревоИБ");
КонецПроцедуры

// Возвращает параметры администрирования кластера для подключения через протокол RAS к указанному центральному серверу.
// Получает данные аутентификации из настроек центрального сервера в зависимости от вида хранения аккаунта.
//
// Параметры:
//  ЦентральныйСервер - Структура:
//                        * АдресRAS - Строка - адрес сервера RAS
//                        * ПортRAS - Строка - порт сервера RAS
//                        * ВидХраненияАккаунта - ПеречислениеСсылка.ВидыХраненияАккаунтов
//                        * Аккаунт - СправочникСсылка.Аккаунты
//                        * Логин - Строка
//                        * Ссылка - СправочникСсылка.ЦентральныеСерверы
//                      - выборка из результата запроса по справочнику ЦентральныеСерверы
//
// Возвращаемое значение:
//   см. АдминистрированиеКластера.ПараметрыАдминистрированияКластера
&НаСервере
Функция ПараметрыАдминистрированияКластераRAS(Знач ЦентральныйСервер)
	ЛогинПароль = ПолучитьДанныеАутентификацииЦентральногоСервера(ЦентральныйСервер);
	
	ПараметрыАдминистрированияКластера = АдминистрированиеКластера.ПараметрыАдминистрированияКластера();
	ПараметрыАдминистрированияКластера.ТипПодключения = "RAS";
	ПараметрыАдминистрированияКластера.АдресСервераАдминистрирования = ЦентральныйСервер.АдресRAS;
	ПараметрыАдминистрированияКластера.ПортСервераАдминистрирования = Число(ЦентральныйСервер.ПортRAS);
	ПараметрыАдминистрированияКластера.ИмяАдминистратораКластера = ЛогинПароль.Логин;
	ПараметрыАдминистрированияКластера.ПарольАдминистратораКластера = ЛогинПароль.Пароль;
	
	Возврат ПараметрыАдминистрированияКластера;
КонецФункции

// Возвращает логин и пароль для подключения к центральному серверу в зависимости от вида хранения аккаунта.
//
// Параметры:
//  ЦентральныйСервер - Структура:
//                        * ВидХраненияАккаунта - ПеречислениеСсылка.ВидыХраненияАккаунтов
//                        * Аккаунт - СправочникСсылка.Аккаунты
//                        * Логин - Строка
//                        * Ссылка - СправочникСсылка.ЦентральныеСерверы
//                      - выборка из результата запроса по справочнику ЦентральныеСерверы
//
// Возвращаемое значение:
//   Структура:
//       * Логин - Строка - логин для подключения к RAS
//       * Пароль - Строка - пароль для подключения к RAS
&НаСервере
Функция ПолучитьДанныеАутентификацииЦентральногоСервера(Знач ЦентральныйСервер)
	ЛогинПароль = Новый Структура("Логин, Пароль", "", "");
	
	Если ЦентральныйСервер.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт Тогда
		Если ЗначениеЗаполнено(ЦентральныйСервер.Аккаунт) Тогда
			ЛогинПароль.Логин = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦентральныйСервер.Аккаунт, "Логин");
			ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(ЦентральныйСервер.Аккаунт);
		КонецЕсли;
	ИначеЕсли ЦентральныйСервер.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль Тогда
		ЛогинПароль.Логин = ЦентральныйСервер.Логин;
		ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(ЦентральныйСервер.Ссылка);
	КонецЕсли;
	Возврат ЛогинПароль;
КонецФункции
#КонецОбласти
