#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоИБ
&НаКлиенте
Процедура ДеревоИБВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ДеревоИБИмя Тогда
		ПоказатьЗначение(, Элементы.ДеревоИБ.ТекущиеДанные.Объект);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Зачитать(Команда)
	ЗачитатьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗачитатьНаСервере()
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЦентральныеСерверы.Ссылка КАК Ссылка,
		|	ЦентральныеСерверы.Наименование КАК Наименование,
		|	ЦентральныеСерверы.АдресRAS КАК АдресRAS,
		|	ЦентральныеСерверы.ПортRAS КАК ПортRAS,
		|	ЦентральныеСерверы.ВидХраненияАккаунта КАК ВидХраненияАккаунта,
		|	ЦентральныеСерверы.Логин КАК Логин,
		|	ЦентральныеСерверы.Аккаунт КАК Аккаунт
		|ИЗ
		|	Справочник.ЦентральныеСерверы КАК ЦентральныеСерверы
		|ГДЕ
		|	НЕ ЦентральныеСерверы.ПометкаУдаления
		|	И НЕ ЦентральныеСерверы.ЭтоГруппа";
	
	Если Не ОтображатьСкрытые Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		Оператор = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
		Оператор.Отбор.Добавить("НЕ ЦентральныеСерверы.Скрыть");
		ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	ВыборкаЦС = Запрос.Выполнить().Выбрать();
	Дерево = РеквизитФормыВЗначение("ДеревоИБ");
	Дерево.Строки.Очистить();

	Пока ВыборкаЦС.Следующий() Цикл
		ПараметрыАдминистрированияКластера = Справочники.ЦентральныеСерверы.ПараметрыАдминистрированияКластераRAS(ВыборкаЦС);
		
		СтрокаСервера = Дерево.Строки.Добавить();
		СтрокаСервера.Имя = Строка(ВыборкаЦС.Наименование);
		СтрокаСервера.Объект = ВыборкаЦС.Ссылка;
		Кластеры = АдминистрированиеКластера.СвойстваКластеров(ПараметрыАдминистрированияКластера);
		Для Каждого Кластер Из Кластеры Цикл
			КластерСсылка = Справочники.Кластеры.ПолучитьИлиСоздатьКластер(ВыборкаЦС.Ссылка, Кластер["name"], ОтображатьСкрытые);
			Если НЕ ЗначениеЗаполнено(КластерСсылка) Тогда // Пустая ссылка - значит, элемент скрыт
				Продолжить;
			КонецЕсли;
			СтрокаКластера = СтрокаСервера.Строки.Добавить();
			СтрокаКластера.Имя = Кластер["name"];
			СтрокаКластера.Объект = КластерСсылка;
			ПараметрыАдминистрированияКластера.ИмяАдминистратораКластера = "";
			ПараметрыАдминистрированияКластера.ПарольАдминистратораКластера = "";
			
			ИнформационныеБазы = АдминистрированиеКластера.СвойстваИнформационныхБаз(
																	Кластер["cluster"],
																	ПараметрыАдминистрированияКластера);
			Для Каждого ИнформационнаяБаза Из ИнформационныеБазы Цикл
				ДобавитьСтрокуИнформационнойБазы(СтрокаКластера, ИнформационнаяБаза, ПараметрыАдминистрированияКластера);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дерево, "ДеревоИБ");
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуИнформационнойБазы(СтрокаКластера, ИнформационнаяБаза, ПараметрыАдминистрированияКластера)
	ИБОбъект = Справочники.ИнформационныеБазы.ПолучитьИлиСоздатьИБОбъект(
																СтрокаКластера.Объект,
																ИнформационнаяБаза["name"],
																ОтображатьСкрытые);
	Если ИБОбъект = Неопределено Тогда // элемент скрыт
		Возврат;
	КонецЕсли;
	СтрокаИБ = СтрокаКластера.Строки.Добавить();
	СтрокаИБ.Имя    = ИБОбъект.Имя;
	СтрокаИБ.Объект = ИБОбъект.Ссылка;
	ЛогинПароль = ИБОбъект.ПолучитьДанныеАутентификации();
	
	
	ПараметрыАдминистрированияИБ = АдминистрированиеКластера.ПараметрыАдминистрированияИнформационнойБазыКластера();
	ПараметрыАдминистрированияИБ.ИмяВКластере = ИБОбъект.Имя;
	ПараметрыАдминистрированияИБ.ИмяАдминистратораИнформационнойБазы = ЛогинПароль.Логин;
	ПараметрыАдминистрированияИБ.ПарольАдминистратораИнформационнойБазы = ЛогинПароль.Пароль;
	
	Попытка
		СвойстваБлокировки = АдминистрированиеКластера.БлокировкаСеансовИЗаданийИнформационнойБазы(
																ПараметрыАдминистрированияКластера,
																ПараметрыАдминистрированияИБ);
		СтрокаИБ.БлокировкаСеанса = СвойстваБлокировки.БлокировкаСеансов;
		СтрокаИБ.ДатаС            = СвойстваБлокировки.ДатаС;
		СтрокаИБ.ДатаПо           = СвойстваБлокировки.ДатаПо;
	Исключение
		СтрокаИБ.ДатаС            = Дата(2020, 11, 11);
		// Если параметры администрирования ИБ не заданы или нет прав - оставляем поля пустыми.
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ДеревоИБ.ПолучениеБлокировкиСеансов'"),
			УровеньЖурналаРегистрации.Предупреждение,
			,
			СтрокаИБ.Объект,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
