#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает параметры администрирования кластера для подключения через протокол RAS к указанному центральному серверу.
// Получает данные аутентификации из настроек центрального сервера в зависимости от вида хранения аккаунта.
//
// Параметры:
//  ЦентральныйСервер - Структура:
//                        * АдресRAS - Строка - адрес сервера RAS
//                        * ПортRAS - Строка - порт сервера RAS
//                        * ВидХраненияАккаунта - ПеречислениеСсылка.ВидыХраненияАккаунтов
//                        * Аккаунт - СправочникСсылка.Аккаунты
//                        * Логин - Строка
//                        * Ссылка - СправочникСсылка.ЦентральныеСерверы
//                      - выборка из результата запроса по справочнику ЦентральныеСерверы
//
// Возвращаемое значение:
//   см. АдминистрированиеКластера.ПараметрыАдминистрированияКластера
//
Функция ПараметрыАдминистрированияКластераRAS(Знач ЦентральныйСервер) Экспорт
	ЛогинПароль = ПолучитьДанныеАутентификации(ЦентральныйСервер);
	
	ПараметрыАдминистрированияКластера = АдминистрированиеКластера.ПараметрыАдминистрированияКластера();
	ПараметрыАдминистрированияКластера.ТипПодключения = "RAS";
	ПараметрыАдминистрированияКластера.АдресСервераАдминистрирования = ЦентральныйСервер.АдресRAS;
	ПараметрыАдминистрированияКластера.ПортСервераАдминистрирования = Число(ЦентральныйСервер.ПортRAS);
	ПараметрыАдминистрированияКластера.ИмяАдминистратораКластера = ЛогинПароль.Логин;
	ПараметрыАдминистрированияКластера.ПарольАдминистратораКластера = ЛогинПароль.Пароль;
	
	Возврат ПараметрыАдминистрированияКластера;
КонецФункции

// Возвращает логин и пароль для подключения к центральному серверу в зависимости от вида хранения аккаунта.
//
// Параметры:
//  ЦентральныйСервер - Структура:
//                        * ВидХраненияАккаунта - ПеречислениеСсылка.ВидыХраненияАккаунтов
//                        * Аккаунт - СправочникСсылка.Аккаунты
//                        * Логин - Строка
//                        * Ссылка - СправочникСсылка.ЦентральныеСерверы
//                      - выборка из результата запроса по справочнику ЦентральныеСерверы
//
// Возвращаемое значение:
//   Структура:
//       * Логин - Строка - логин для подключения к RAS
//       * Пароль - Строка - пароль для подключения к RAS
//
Функция ПолучитьДанныеАутентификации(Знач ЦентральныйСервер) Экспорт
	ЛогинПароль = Новый Структура("Логин, Пароль", "", "");
	
	Если ЦентральныйСервер.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт Тогда
		Если ЗначениеЗаполнено(ЦентральныйСервер.Аккаунт) Тогда
			ЛогинПароль.Логин = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦентральныйСервер.Аккаунт, "Логин");
			ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(ЦентральныйСервер.Аккаунт);
		КонецЕсли;
	ИначеЕсли ЦентральныйСервер.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль Тогда
		ЛогинПароль.Логин = ЦентральныйСервер.Логин;
		ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(ЦентральныйСервер.Ссылка);
	КонецЕсли;
	Возврат ЛогинПароль;
КонецФункции

#КонецОбласти

#КонецЕсли
