#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПарольВХранилище = ОбщегоНазначенияСтраж.ПолучитьПароль(Объект.Ссылка);	
	Пароль = ?(ЗначениеЗаполнено(ПарольВХранилище), УникальныйИдентификатор, "");
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПарольИзменен Тогда
		Пароль = СокрЛП(Пароль);
		ОбщегоНазначенияСтраж.ЗаписатьПароль(ТекущийОбъект.Ссылка, Пароль);
		Пароль = ?(ЗначениеЗаполнено(Пароль), УникальныйИдентификатор, "");
		ПарольИзменен = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодглядетьПароль(Команда)
	ПодглядетьПарольНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодглядетьПарольНаСервере()
	ПарольВХранилище = ОбщегоНазначенияСтраж.ПолучитьПароль(Объект.Ссылка);	
	Если ЗначениеЗаполнено(ПарольВХранилище) Тогда
		ОбщегоНазначения.СообщитьПользователю(ПарольВХранилище);
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Пароль не задан'"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


