#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.ВидХраненияАккаунта) Тогда
		Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ПортRAS) Тогда
		Объект.ПортRAS = 1545;
	КонецЕсли;

	ПарольВХранилище = ОбщегоНазначенияСтраж.ПолучитьПароль(Объект.Ссылка);
	Пароль = ?(ЗначениеЗаполнено(ПарольВХранилище), УникальныйИдентификатор, "");
	
	ОбновитьВидимостьИДоступность();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПарольИзменен Тогда
		Пароль = СокрЛП(Пароль);
		ОбщегоНазначенияСтраж.ЗаписатьПароль(ТекущийОбъект.Ссылка, Пароль);
		Пароль = ?(ЗначениеЗаполнено(Пароль), УникальныйИдентификатор, "");
		ПарольИзменен = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидХраненияАккаунтаПриИзменении(Элемент)
	ОбновитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	ПроверитьСоединениеНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьВидимостьИДоступность()
	Элементы.Аккаунт.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт);
	Элементы.Логин.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль);
	Элементы.Пароль.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль);
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	//@skip-check module-unused-local-variable
	Перем СтрЛогин, СтрПароль;
	
	Если Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт Тогда
		Если Не ЗначениеЗаполнено(Объект.Аккаунт) Тогда
			ВызватьИсключение НСтр("ru = 'Не заполнен аккаунт'");		
		КонецЕсли;
		СтрЛогин = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Аккаунт, "Логин");
		СтрПароль = ОбщегоНазначенияСтраж.ПолучитьПароль(Объект.Аккаунт);
	ИначеЕсли Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль Тогда
		СтрЛогин = Объект.Логин;
		СтрПароль = ОбщегоНазначенияСтраж.ПолучитьПароль(Объект.Ссылка);
	Иначе
		ВызватьИсключение НСтр("ru = 'Неожиданный вид хранения аккаунта'");
	КонецЕсли;

    Агент = Новый АдминистрированиеСервера(Объект.АдресRAS, Объект.ПортRAS);
//    Агент.ВыполнитьАутентификацию(СтрЛогин, СтрПароль);
    Кластеры = Агент.ПолучитьКластеры();
    
	МассивСообщений = Новый Массив;
    ШаблонТекста = НСтр("ru='Соединение прошло успешно. На центральном сервере обнаружено %1 кластер(ов)'");
	МассивСообщений.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекста, Кластеры.Количество()));
	МассивСообщений.Добавить("-----");
    Для Каждого Кластер Из Кластеры Цикл
        МассивСообщений.Добавить(Кластер.Имя);
    КонецЦикла;
    
    СообщениеПользователю = Новый СообщениеПользователю;
    СообщениеПользователю.Текст = СтрСоединить(МассивСообщений, Символы.ПС);
    СообщениеПользователю.Сообщить();

КонецПроцедуры
#КонецОбласти
