#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Возвращает ссылку на ИБ кластера с заданным именем.
// Если ИБ не существует - создает её.
//
// Параметры:
//  Кластер - СправочникСсылка.Кластеры
//  ИмяИБ - Строка
//
// Возвращаемое значение:
//  СправочникСсылка.ИнформационныеБазы - Ссылка на существующую или созданную ИБ
//
Функция ПолучитьИлиСоздатьИБ(Кластер, ИмяИБ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИнформационныеБазы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	|ГДЕ
	|	ИнформационныеБазы.Владелец = &Кластер
	|	И ИнформационныеБазы.Имя = &ИмяИБ";
	Запрос.УстановитьПараметр("Кластер", Кластер);
	Запрос.УстановитьПараметр("ИмяИБ", ИмяИБ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		НоваяИБ = СоздатьЭлемент();
		НоваяИБ.Владелец = Кластер;
		НоваяИБ.Имя = ИмяИБ;
		НоваяИБ.Наименование = СтрШаблон("%1\%2", Строка(Кластер), ИмяИБ);
		НоваяИБ.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль;
		НоваяИБ.Записать();
		Возврат НоваяИБ.Ссылка;
	КонецЕсли;
КонецФункции

#КонецОбласти
 
#КонецЕсли