#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Возвращает логин и пароль для подключения к ИБ в зависимости от вида хранения аккаунта.
//
// Возвращаемое значение:
//   Структура:
//       * Логин - Строка - логин для подключения к ИБ
//       * Пароль - Строка - пароль для подключения к ИБ
//
Функция ПолучитьДанныеАутентификации() Экспорт
	ЛогинПароль = Новый Структура("Логин, Пароль", "", "");
	
	Если ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт Тогда
		Если ЗначениеЗаполнено(Аккаунт) Тогда
			ЛогинПароль.Логин = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Логин");
			ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(Аккаунт);
		КонецЕсли;
	ИначеЕсли ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль Тогда
		ЛогинПароль.Логин = Логин;
		ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(Ссылка);
	КонецЕсли;
	Возврат ЛогинПароль;
КонецФункции
#КонецОбласти
#КонецЕсли