#Область ПрограммныйИнтерфейс

// Возвращает сохраненный пароль из безопасного хранилища для указанного объекта.
//
// Параметры:
//   ОбъектСсылка - СправочникСсылка, ДокументСсылка - ссылка на объект, для которого требуется получить пароль
//
// Возвращаемое значение:
//   Строка - сохраненный пароль или пустая строка, если пароль не найден
Функция ПолучитьПароль(ОбъектСсылка) Экспорт
	СтрПароль = "";
	УстановитьПривилегированныйРежим(Истина);
	ПарольВХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ОбъектСсылка);
	УстановитьПривилегированныйРежим(Ложь);
	Если ЗначениеЗаполнено(ПарольВХранилище) Тогда
		СтрПароль = ПарольВХранилище;
	КонецЕсли;
	Возврат СтрПароль;
КонецФункции

// Записывает пароль для указанного объекта в безопасное хранилище.
//
// Параметры:
//   ОбъектСсылка - СправочникСсылка, ДокументСсылка - ссылка на объект, для которого сохраняется пароль
//   Пароль - Строка - пароль для сохранения
Процедура ЗаписатьПароль(ОбъектСсылка, Пароль) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ОбъектСсылка, Пароль);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

// Обрабатывает изменения пароля в форме перед записью объекта.
//
// Параметры:
//   ОбъектСсылка - СправочникСсылка.ЦентральныеСерверы,
//                  СправочникСсылка.Кластеры,
//                  СправочникСсылка.ИнформационныеБазы,
//                  СправочникСсылка.Аккаунты - ссылка на записываемый объект
//   ПарольИзменен - Булево - признак того, что пароль был изменен на форме (по ссылке)
//   Пароль - Строка - текущее значение пароля на форме (по ссылке)
Процедура ОбработатьПарольФормыПриЗаписи(ОбъектСсылка, ПарольИзменен, Пароль) Экспорт
	Если ПарольИзменен Тогда
		Пароль = СокрЛП(Пароль);
		ЗаписатьПароль(ОбъектСсылка, Пароль);
		Пароль = ?(ЗначениеЗаполнено(Пароль), Новый УникальныйИдентификатор, "");
		ПарольИзменен = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
