#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Возвращает ссылку на кластер центрального сервера с заданным именем.
// Если кластер не существует - создает его.
//
// Параметры:
//  ЦентральныйСервер - СправочникСсылка.ЦентральныеСерверы
//  ИмяКластера - Строка
//
// Возвращаемое значение:
//  СправочникСсылка.Кластеры - Ссылка на существующий или созданный кластер
//
Функция ПолучитьИлиСоздатьКластер(ЦентральныйСервер, ИмяКластера) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Кластеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Кластеры КАК Кластеры
	|ГДЕ
	|	Кластеры.Владелец = &ЦентральныйСервер
	|	И Кластеры.Имя = &ИмяКластера";
	Запрос.УстановитьПараметр("ЦентральныйСервер", ЦентральныйСервер);
	Запрос.УстановитьПараметр("ИмяКластера", ИмяКластера);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		НовыйКластер = СоздатьЭлемент();
		НовыйКластер.Владелец = ЦентральныйСервер;
		НовыйКластер.Имя = ИмяКластера;
		НовыйКластер.Наименование = СтрШаблон("%1\%2", Строка(ЦентральныйСервер), ИмяКластера);
		НовыйКластер.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль;		
		НовыйКластер.Записать();
		Возврат НовыйКластер.Ссылка;
	КонецЕсли;
КонецФункции

#КонецОбласти
 
#КонецЕсли