#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Возвращает ссылку на кластер центрального сервера с заданным именем.
// Если кластер не существует - создает его.
// Если кластер существует, но имеет признак Скрыть и параметр ПоказыватьСкрытые=Ложь - возвращает пустую ссылку.
//
// Параметры:
//  ЦентральныйСервер - СправочникСсылка.ЦентральныеСерверы
//  ИмяКластера - Строка
//  ПоказыватьСкрытые - Булево
//
// Возвращаемое значение:
//  СправочникСсылка.Кластеры - Ссылка на существующий или созданный кластер
//
Функция ПолучитьИлиСоздатьКластер(ЦентральныйСервер, ИмяКластера, ПоказыватьСкрытые) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Кластеры.Ссылка КАК Ссылка,
	|	Кластеры.Скрыть КАК Скрыть
	|ИЗ
	|	Справочник.Кластеры КАК Кластеры
	|ГДЕ
	|	Кластеры.Владелец = &ЦентральныйСервер
	|	И Кластеры.Имя = &ИмяКластера
	|	И Кластеры.ПометкаУдаления = ЛОЖЬ
	|	И Кластеры.ЭтоГруппа = ЛОЖЬ";
	Запрос.УстановитьПараметр("ЦентральныйСервер", ЦентральныйСервер);
	Запрос.УстановитьПараметр("ИмяКластера", ИмяКластера);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Скрыть И НЕ ПоказыватьСкрытые Тогда
			Возврат ПустаяСсылка();
		КонецЕсли;
		Возврат Выборка.Ссылка;
	Иначе
		НовыйКластер = СоздатьЭлемент();
		НовыйКластер.Владелец = ЦентральныйСервер;
		НовыйКластер.Имя = ИмяКластера;
		НовыйКластер.Наименование = СтрШаблон("%1\%2", Строка(ЦентральныйСервер), ИмяКластера);
		НовыйКластер.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль;		
		НовыйКластер.Записать();
		Возврат НовыйКластер.Ссылка;
	КонецЕсли;
КонецФункции

// Возвращает СправочникОбъект.Кластеры с заданным именем в центральном сервере.
// Если кластер не существует - создает его.
// Если кластер существует, но имеет признак Скрыть и параметр ПоказыватьСкрытые=Ложь - возвращает Неопределено
//
// Параметры:
//  ЦентральныйСервер - СправочникСсылка.ЦентральныеСерверы
//  ИмяКластера - Строка
//  ПоказыватьСкрытые - Булево
//
// Возвращаемое значение:
//  СправочникОбъект.Кластеры - Ссылка на существующий или созданный кластер
//  Неопределено - Если Кластер помечен как скрытый, а параметр ПоказыватьСкрытые = Ложь.
//
Функция ПолучитьИлиСоздатьКластерОбъект(ЦентральныйСервер, ИмяКластера, ПоказыватьСкрытые) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Кластеры.Ссылка КАК Ссылка,
	|	Кластеры.Скрыть КАК Скрыть
	|ИЗ
	|	Справочник.Кластеры КАК Кластеры
	|ГДЕ
	|	Кластеры.Владелец = &ЦентральныйСервер
	|	И Кластеры.Имя = &ИмяКластера
	|	И Кластеры.ПометкаУдаления = ЛОЖЬ
	|	И Кластеры.ЭтоГруппа = ЛОЖЬ";
	Запрос.УстановитьПараметр("ЦентральныйСервер", ЦентральныйСервер);
	Запрос.УстановитьПараметр("ИмяКластера", ИмяКластера);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Скрыть И НЕ ПоказыватьСкрытые Тогда
			Возврат Неопределено;
		КонецЕсли;
		Возврат Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		НовыйКластер = СоздатьЭлемент();
		НовыйКластер.Владелец = ЦентральныйСервер;
		НовыйКластер.Имя = ИмяКластера;
		НовыйКластер.Наименование = СтрШаблон("%1\%2", Строка(ЦентральныйСервер), ИмяКластера);
		НовыйКластер.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль;		
		НовыйКластер.Записать();
		Возврат НовыйКластер;
	КонецЕсли;
КонецФункции

#КонецОбласти
 
#КонецЕсли