#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.ВидХраненияАккаунта) Тогда
		Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль;
	КонецЕсли;

	ПарольВХранилище = ОбщегоНазначенияСтраж.ПолучитьПароль(Объект.Ссылка);
	Пароль = ?(ЗначениеЗаполнено(ПарольВХранилище), УникальныйИдентификатор, "");
	
	ОбновитьВидимостьИДоступность();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначенияСтраж.ОбработатьПарольФормыПриЗаписи(ТекущийОбъект.Ссылка, ПарольИзменен, Пароль);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидХраненияАккаунтаПриИзменении(Элемент)
	ОбновитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	ПроверитьСоединениеНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьИДоступность()
	Элементы.Аккаунт.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт);
	Элементы.Логин.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль);
	Элементы.Пароль.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль);
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Владелец) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан центральный сервер (владелец кластера)'");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Имя) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнено имя кластера'");
	КонецЕсли;
	
	ПараметрыАдминистрированияКластера = ПолучитьПараметрыАдминистрированияКластера();
	
	Кластеры = АдминистрированиеКластера.СвойстваКластеров(ПараметрыАдминистрированияКластера);
	КластерНаСервере = Неопределено;
	Для Каждого Кластер Из Кластеры Цикл
		Если Кластер["name"] = Объект.Имя Тогда
			КластерНаСервере = Кластер;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если КластерНаСервере = Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Кластер ""%1"" не найден на центральном сервере'"), Объект.Имя);
	КонецЕсли;
	
	ИнформационныеБазы = АдминистрированиеКластера.СвойстваИнформационныхБаз(
		КластерНаСервере["cluster"], ПараметрыАдминистрированияКластера);
	
	МассивСообщений = Новый Массив;
	ШаблонТекста = НСтр("ru='Соединение с кластером ""%1"" прошло успешно. Информационных баз: %2'");
	МассивСообщений.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонТекста, Объект.Имя, ИнформационныеБазы.Количество()));
	МассивСообщений.Добавить("-----");
	Для Каждого ИБ Из ИнформационныеБазы Цикл
		МассивСообщений.Добавить(ИБ["name"]);
	КонецЦикла;
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = СтрСоединить(МассивСообщений, Символы.ПС);
	СообщениеПользователю.Сообщить();
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыАдминистрированияКластера()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦС.Ссылка КАК Ссылка,
		|	ЦС.АдресRAS КАК АдресRAS,
		|	ЦС.ПортRAS КАК ПортRAS,
		|	ЦС.ВидХраненияАккаунта КАК ВидХраненияАккаунта,
		|	ЦС.Логин КАК Логин,
		|	ЦС.Аккаунт КАК Аккаунт
		|ИЗ
		|	Справочник.ЦентральныеСерверы КАК ЦС
		|ГДЕ
		|	ЦС.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Владелец);
	ВыборкаЦС = Запрос.Выполнить().Выбрать();
	Если Не ВыборкаЦС.Следующий() Тогда
		ВызватьИсключение НСтр("ru = 'Центральный сервер не найден'");
	КонецЕсли;
	
	ПараметрыКластера = Справочники.ЦентральныеСерверы.ПараметрыАдминистрированияКластераRAS(ВыборкаЦС);
	ЛогинПарольКластера = ПолучитьЛогинПарольКластера();
	ПараметрыКластера.ИмяАдминистратораКластера     = ЛогинПарольКластера.Логин;
	ПараметрыКластера.ПарольАдминистратораКластера = ЛогинПарольКластера.Пароль;
	Возврат ПараметрыКластера;
КонецФункции

&НаСервере
Функция ПолучитьЛогинПарольКластера()
	ЛогинПароль = Новый Структура("Логин, Пароль", "", "");
	
	Если Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт Тогда
		Если Не ЗначениеЗаполнено(Объект.Аккаунт) Тогда
			ВызватьИсключение НСтр("ru = 'Не заполнен аккаунт'");
		КонецЕсли;
		ЛогинПароль.Логин  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Аккаунт, "Логин");
		ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(Объект.Аккаунт);
	ИначеЕсли Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль Тогда
		ЛогинПароль.Логин  = Объект.Логин;
		ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(Объект.Ссылка);
	Иначе
		ВызватьИсключение НСтр("ru = 'Неожиданный вид хранения аккаунта'");
	КонецЕсли;
	
	Возврат ЛогинПароль;
КонецФункции

#КонецОбласти
